{
  "sections": [
    {
      "id": "section-welcome",
      "name": "welcome",
      "displayName": "Welcome",
      "description": "Create an invitation to begin the journey into God's presence",
      "order": 1
    },
    {
      "id": "section-mind",
      "name": "mind",
      "displayName": "Mind",
      "description": "Quiet mental distractions through active imagination and release",
      "order": 2
    },
    {
      "id": "section-body",
      "name": "body",
      "displayName": "Body",
      "description": "Release physical tension and create somatic stillness",
      "order": 3
    },
    {
      "id": "section-spirit",
      "name": "spirit",
      "displayName": "Spirit",
      "description": "Invite the Holy Spirit and establish spiritual focus",
      "order": 4
    },
    {
      "id": "section-meditation",
      "name": "meditation",
      "displayName": "Meditation",
      "description": "Deep communion with God through Scripture and contemplation",
      "order": 5
    },
    {
      "id": "section-incorporate",
      "name": "incorporate",
      "displayName": "Incorporate",
      "description": "Take the practice into daily life",
      "order": 6
    }
  ],
  "techniques": [
    {
      "id": "welcome-001",
      "sectionId": "section-welcome",
      "name": "Simple Welcome",
      "description": "A warm, inviting introduction to sacred time with God",
      "scriptTemplate": "Welcome to this time set apart for you and God. Find a comfortable position, whether sitting or lying down. Take a moment to settle in. {pause} This is your secret place, where the Father sees you and delights in your presence. Let the cares of the day fade as you turn your heart toward Him.",
      "defaultDuration": 60,
      "minDuration": 45,
      "maxDuration": 90,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-01T00:00:00Z"
    },
    {
      "id": "welcome-002",
      "sectionId": "section-welcome",
      "name": "Scripture-Based Welcome",
      "description": "Begin with the foundational verse of the secret place",
      "scriptTemplate": "Welcome. Let's begin by reading together from Matthew 6:6: 'But you, when you pray, go into your room, and when you have shut your door, pray to your Father who is in the secret place; and your Father who sees in secret will reward you openly.' {pause} You are here, in your secret place. God sees you. He delights in this time with you. Find a comfortable position and let yourself settle in.",
      "defaultDuration": 75,
      "minDuration": 60,
      "maxDuration": 90,
      "scriptureReferences": ["Matthew 6:6"],
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-08T00:00:00Z"
    },
    {
      "id": "welcome-003",
      "sectionId": "section-welcome",
      "name": "Breath-Awareness Welcome",
      "description": "Arrive through gentle attention to breathing",
      "scriptTemplate": "Welcome. Begin by finding a comfortable position. Close your eyes if that feels right. {pause} Notice your breath, just as it is. No need to change it. {pause} With each breath, you're arriving more fully in this moment. {pause} This is time set apart. Sacred time. Time with the One who loves you beyond measure. {pause} Let yourself arrive.",
      "defaultDuration": 90,
      "minDuration": 60,
      "maxDuration": 120,
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "welcome-004",
      "sectionId": "section-welcome",
      "name": "Gratitude Welcome",
      "description": "Enter through thankfulness for God's presence",
      "scriptTemplate": "Welcome to this sacred time. Settle into a comfortable position and take a deep breath. {pause} Before we begin, let's take a moment to give thanks. Thank God for this moment, for the breath in your lungs, for His constant presence. {pause} He has been with you all day, even when you didn't notice. Now you're here, intentionally turning your attention to Him. {pause} What a gift this is.",
      "defaultDuration": 75,
      "minDuration": 60,
      "maxDuration": 90,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "mind-001",
      "sectionId": "section-mind",
      "name": "Sacred Room Visualization",
      "description": "Create your familiar sacred space and release distractions at the cross",
      "scriptTemplate": "In your mind's eye, see the door to your secret place. It's a familiar door, one you've walked through before or will come to know well. {pause} Reach for the handle and open it. Step inside. {pause} This is your sacred room. Notice what it looks like. Is there a window? What kind of light fills the space? What do you see? {pause} In the center of your room, there is a cross. Simple and beautiful. {pause} Now, one by one, bring your worries and concerns to mind. The things weighing on your heart. {pause} As each one comes to mind, imagine carrying it to the cross and placing it at the foot. Let it go. {pause} Continue with each worry, each distraction. Place them all at the cross. {pause} The cross can hold them. God sees them. You can let them go for now.",
      "defaultDuration": 240,
      "minDuration": 180,
      "maxDuration": 300,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-01T00:00:00Z"
    },
    {
      "id": "mind-002",
      "sectionId": "section-mind",
      "name": "Cross-Centered Release",
      "description": "Simplified practice focused on releasing burdens to Jesus",
      "scriptTemplate": "Take a deep breath and bring your attention to your mind. {pause} Notice the thoughts swirling there. The to-do lists, the worries, the replays of conversations. {pause} Now picture Jesus standing before you, arms open, ready to receive whatever you're carrying. {pause} One by one, name the things on your mind, even if just silently in your heart. {pause} As you name each one, imagine handing it to Jesus. Watch Him take it from you. {pause} He can carry what you cannot. Let yourself release each burden into His hands. {pause} Continue until your mind feels lighter, quieter, more still.",
      "defaultDuration": 210,
      "minDuration": 150,
      "maxDuration": 300,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-08T00:00:00Z"
    },
    {
      "id": "mind-003",
      "sectionId": "section-mind",
      "name": "Mental Decluttering",
      "description": "Organize and release mental distractions through gentle acknowledgment",
      "scriptTemplate": "Bring your awareness to your mind. Notice all the thoughts competing for attention. {pause} Don't fight them or push them away. Simply acknowledge each one. 'There's a thought about work. There's a worry about finances. There's a memory from earlier today.' {pause} As you acknowledge each thought, imagine it like a cloud drifting across the sky of your mind. You see it, you name it, you let it pass. {pause} Continue this gentle watching and releasing. Thoughts come, you notice them, they drift away. {pause} With each thought that passes, your mind becomes clearer, more spacious, more quiet. {pause} This is mental decluttering. Making space for God.",
      "defaultDuration": 240,
      "minDuration": 180,
      "maxDuration": 300,
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "mind-004",
      "sectionId": "section-mind",
      "name": "Walking with Jesus",
      "description": "Imaginative prayer of walking alongside Jesus, sharing what's on your mind",
      "scriptTemplate": "Imagine yourself on a peaceful path. It might be a beach, a forest trail, a quiet road. {pause} You notice someone walking toward you. As they get closer, you realize it's Jesus. {pause} He smiles at you. He's been waiting for this time with you. He falls into step beside you, and you begin to walk together. {pause} He asks, 'What's on your mind today?' {pause} Tell Him. Out loud or in the silence of your heart, share what you've been carrying. The worries, the joys, the questions, the confusion. {pause} He listens. He doesn't interrupt. He simply walks with you and receives every word. {pause} As you share, feel the weight lifting. This is what the secret place is - honest conversation with the One who loves you most.",
      "defaultDuration": 270,
      "minDuration": 180,
      "maxDuration": 360,
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "mind-005",
      "sectionId": "section-mind",
      "name": "Breath-Focused Quieting",
      "description": "Use breath as anchor to release mental distractions",
      "scriptTemplate": "Bring your attention to your breath. {pause} Notice the natural rhythm of breathing in and breathing out. {pause} When a thought arises, simply notice it, then gently return your attention to your breath. {pause} Breathing in, you're aware you're breathing in. Breathing out, you're aware you're breathing out. {pause} Thoughts will come. That's natural. Each time, just return to the breath. No judgment, no frustration. Just gentle returning. {pause} With each breath, your mind becomes quieter. More settled. More present. {pause} This simple practice creates space for God to speak into the stillness.",
      "defaultDuration": 180,
      "minDuration": 120,
      "maxDuration": 300,
      "difficulty": "advanced",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-29T00:00:00Z"
    },
    {
      "id": "body-001",
      "sectionId": "section-body",
      "name": "Body Scan Relaxation",
      "description": "Progressive relaxation from head to toe",
      "scriptTemplate": "Now bring your awareness to your body. We'll move through it slowly, releasing tension as we go. {pause} Start at the crown of your head. Notice any tightness there and let it soften. {pause} Move to your forehead. Let it smooth. Your eyes, let them rest. Your jaw, release any clenching. {pause} Feel your shoulders. Often we hold so much there. Let them drop, heavy and relaxed. {pause} Down your arms to your fingertips. Release any tension. {pause} Your chest and belly. Let them rise and fall naturally with your breath. Soft and at ease. {pause} Your back, your hips. Let them sink into support. {pause} Down your legs, your knees, your calves. {pause} All the way to your feet and toes. Let everything relax. {pause} Your whole body, at rest. A temple, prepared for God's presence.",
      "defaultDuration": 300,
      "minDuration": 180,
      "maxDuration": 600,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-01T00:00:00Z"
    },
    {
      "id": "body-002",
      "sectionId": "section-body",
      "name": "Holy Spirit as Water",
      "description": "Visualize the Holy Spirit as warm water flowing over your body",
      "scriptTemplate": "Bring your attention to your body. {pause} Now imagine the Holy Spirit as warm, gentle water. It begins at the crown of your head, like a peaceful stream. {pause} Feel it flowing over your forehead, washing away tension. Over your face, your neck, your shoulders. {pause} The water flows down your arms, bringing warmth and release. {pause} It cascades over your chest, your back, your belly. Soothing and healing. {pause} Down your hips, your legs, all the way to your feet. {pause} The Holy Spirit washes over every part of you, bringing peace, bringing rest, bringing wholeness. {pause} Your body is a temple, and the Spirit is here, making you whole.",
      "defaultDuration": 270,
      "minDuration": 180,
      "maxDuration": 480,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-08T00:00:00Z"
    },
    {
      "id": "body-003",
      "sectionId": "section-body",
      "name": "Holy Spirit as Cloud",
      "description": "Visualize the Holy Spirit as a gentle cloud enveloping your body",
      "scriptTemplate": "Bring awareness to your body, sitting or lying in this space. {pause} Now imagine the Holy Spirit as a gentle, warm cloud above you. {pause} Slowly, the cloud begins to descend, like a soft blanket of peace. {pause} It touches the top of your head first, and as it does, feel your head relax completely. {pause} The cloud continues to descend, enveloping your face, your neck, your shoulders. Wherever it touches, tension melts away. {pause} It moves down your torso, your arms, wrapping you in comfort. {pause} Down your legs, to your feet. {pause} The cloud now surrounds your entire body. You're enveloped in the Holy Spirit's presence. Safe. Held. At peace. {pause} Rest in this embrace.",
      "defaultDuration": 300,
      "minDuration": 180,
      "maxDuration": 480,
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "body-004",
      "sectionId": "section-body",
      "name": "Breath and Body Awareness",
      "description": "Connect breath with body sensations for grounded presence",
      "scriptTemplate": "Notice your body in this moment. {pause} Where do you feel your body making contact with what supports you? The chair, the floor, the cushion? {pause} Notice the weight of your body. Its solidity. Its presence. {pause} Now bring awareness to your breath moving through your body. {pause} As you breathe in, notice your chest and belly expanding. {pause} As you breathe out, feel them softening. {pause} Let your breath be natural. Let your body be at ease. {pause} You are here, fully present in your body. And your body is a gift, a temple for the Spirit. {pause} Rest in this awareness. Grounded. Present. Embodied.",
      "defaultDuration": 240,
      "minDuration": 180,
      "maxDuration": 420,
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "body-005",
      "sectionId": "section-body",
      "name": "Body as Temple",
      "description": "Scriptural meditation on the body as God's dwelling place",
      "scriptTemplate": "Paul writes in 1 Corinthians 6:19, 'Do you not know that your body is the temple of the Holy Spirit who is in you?' {pause} Bring awareness to your body now. Not with judgment, but with reverence. {pause} This body is a temple. A dwelling place for God Himself. {pause} Notice your breath, the beating of your heart, the life flowing through you. {pause} God chose to make His home in you. {pause} Let this truth wash over you. Your body, with all its imperfections, is holy ground. {pause} As you breathe, imagine the Holy Spirit dwelling in every cell, every fiber. {pause} You are the temple. And God is here, with you, in you. {pause} Rest in this profound truth.",
      "defaultDuration": 300,
      "minDuration": 180,
      "maxDuration": 480,
      "scriptureReferences": ["1 Corinthians 6:19"],
      "difficulty": "advanced",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-29T00:00:00Z"
    },
    {
      "id": "spirit-001",
      "sectionId": "section-spirit",
      "name": "Simple Spirit Invitation",
      "description": "Direct, heartfelt invitation for the Holy Spirit's presence",
      "scriptTemplate": "Now we turn our attention to the Spirit. {pause} In your own words, either out loud or in the silence of your heart, invite the Holy Spirit to be with you. {pause} You might say, 'Holy Spirit, come. Speak to me. Reveal the Father's heart.' {pause} Or simply, 'Come, Holy Spirit.' {pause} He is already here, but this invitation opens us to notice, to receive, to listen. {pause} Holy Spirit, we welcome You. Guide us in this time. Speak what the Father wants us to hear. {pause} We're listening.",
      "defaultDuration": 90,
      "minDuration": 60,
      "maxDuration": 150,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-01T00:00:00Z"
    },
    {
      "id": "spirit-002",
      "sectionId": "section-spirit",
      "name": "Breath Prayer Creation",
      "description": "Craft a personal focus sentence to repeat during meditation",
      "scriptTemplate": "The Holy Spirit is here with us. {pause} Now, in a moment of silence, let a simple sentence or word rise in your heart. Something that helps you stay focused on God. {pause} It might be, 'Speak, Lord, I'm listening.' Or 'I rest in You.' Or 'Father, I trust You.' Or simply, 'Jesus.' {pause} Take a moment and let the Spirit guide you to your word or phrase. {silence 30 seconds} Whatever came to you, hold it gently. {pause} This is your breath prayer for this meditation. As we move forward, you can return to it whenever you need to re-center. {pause} Let it become like breathing - natural, constant, connecting you to God's presence.",
      "defaultDuration": 120,
      "minDuration": 90,
      "maxDuration": 180,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-08T00:00:00Z"
    },
    {
      "id": "spirit-003",
      "sectionId": "section-spirit",
      "name": "Listening Prayer",
      "description": "Quiet waiting and listening for the Spirit's gentle voice",
      "scriptTemplate": "Holy Spirit, we invite Your presence. Come and speak to us. {pause} In 1 Samuel 3:10, the boy Samuel prays, 'Speak, for Your servant hears.' {pause} That's our posture now. Listening. Open. Ready to hear. {pause} In the silence, the Spirit often speaks. Not always in words, but in impressions, in peace, in gentle knowing. {pause} So we wait. We listen. We pay attention. {pause} If your mind wanders, gently return to listening. {pause} Holy Spirit, speak. We're here. We're listening. {silence 30 seconds}",
      "defaultDuration": 120,
      "minDuration": 90,
      "maxDuration": 180,
      "scriptureReferences": ["1 Samuel 3:10"],
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "spirit-004",
      "sectionId": "section-spirit",
      "name": "Be Still and Know",
      "description": "Scriptural focus on Psalm 46:10 as invitation to stillness",
      "scriptTemplate": "Listen to these words from Psalm 46:10: 'Be still, and know that I am God.' {pause} Be still... and know. {pause} Holy Spirit, teach us what it means to be still in Your presence. {pause} Not striving, not performing, not doing. Just being. {pause} Still. Quiet. Receptive. {pause} And in that stillness, we know. We know You are God. We know You are here. We know You are good. {pause} Let this verse wash over you. 'Be still, and know that I am God.' {pause} Repeat it silently if it helps. Let it become your anchor. {pause} Be still. Know God. He is here.",
      "defaultDuration": 120,
      "minDuration": 90,
      "maxDuration": 180,
      "scriptureReferences": ["Psalm 46:10"],
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "meditation-001",
      "sectionId": "section-meditation",
      "name": "I AM the Bread of Life",
      "description": "Meditate on Jesus' first I AM statement about spiritual nourishment",
      "scriptTemplate": "Open your Bible, or your heart, to John 6:35. Jesus says, 'I am the bread of life. He who comes to Me shall never hunger, and he who believes in Me shall never thirst.' {pause} I AM the bread of life. {pause} What does it mean that Jesus is bread? Bread sustains. Bread nourishes. Bread keeps us alive. {pause} Ask Jesus now: 'What are You feeding me today? What nourishment do I need from You?' {pause} Listen. {silence 45 seconds} Perhaps He brings to mind a word, a truth, a promise. Receive it. {pause} 'He who comes to Me shall never hunger.' Are you hungry today? Hungry for meaning, for purpose, for love? {pause} Come to Jesus, the bread. Let Him fill you. {pause} Sit with Him in silence now. Let Him nourish your soul. {silence 90 seconds}",
      "defaultDuration": 480,
      "minDuration": 300,
      "maxDuration": 1200,
      "scriptureReferences": ["John 6:35"],
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-01T00:00:00Z"
    },
    {
      "id": "meditation-002",
      "sectionId": "section-meditation",
      "name": "I AM the Light of the World",
      "description": "Meditate on Jesus as light in darkness",
      "scriptTemplate": "Jesus speaks in John 8:12: 'I am the light of the world. He who follows Me shall not walk in darkness, but have the light of life.' {pause} I AM the light. {pause} Imagine yourself in a dark place. Maybe it's literal darkness, or maybe it's the darkness of confusion, fear, or despair. {pause} Now see Jesus. He is radiant, glowing with warm, beautiful light. {pause} As He comes near, the darkness flees. It has no power in His presence. {pause} Ask Him: 'Where do I need Your light today? What darkness are You illuminating?' {pause} Listen. {silence 45 seconds} Let Him show you. He might bring to mind a situation, a relationship, a hidden fear. {pause} Watch as His light touches that place. See what it reveals. {pause} 'He who follows Me shall not walk in darkness.' You don't have to stumble anymore. The Light is here. Follow Him. {silence 90 seconds}",
      "defaultDuration": 540,
      "minDuration": 300,
      "maxDuration": 1200,
      "scriptureReferences": ["John 8:12"],
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-08T00:00:00Z"
    },
    {
      "id": "meditation-003",
      "sectionId": "section-meditation",
      "name": "I AM the Good Shepherd",
      "description": "Rest in Jesus' care and guidance as the Good Shepherd",
      "scriptTemplate": "In John 10:11, Jesus says, 'I am the good shepherd. The good shepherd gives His life for the sheep.' {pause} I AM the good shepherd. {pause} Picture yourself as a sheep. Not in a demeaning way, but honestly. Sheep need guidance. They need protection. They need a shepherd. {pause} See Jesus, your Shepherd. He knows you by name. He knows exactly where you are and what you need. {pause} Ask Him: 'Good Shepherd, where are You leading me? What do You want me to know today?' {pause} Listen. {silence 45 seconds} Maybe He's leading you to rest. To green pastures and still waters, as Psalm 23 says. {pause} Or maybe He's leading you through a valley, but you don't have to be afraid because He's with you. {pause} The good shepherd gives His life for the sheep. He has already given everything for you. {pause} Rest in His care. You are safe. You are known. You are loved. {silence 90 seconds}",
      "defaultDuration": 600,
      "minDuration": 300,
      "maxDuration": 1200,
      "scriptureReferences": ["John 10:11", "Psalm 23"],
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "meditation-004",
      "sectionId": "section-meditation",
      "name": "The Prodigal Son",
      "description": "Immerse yourself in the parable of extravagant love and return",
      "scriptTemplate": "Let's enter the story of the Prodigal Son from Luke 15. {pause} Imagine yourself in the story. Are you the younger son, who ran away and wasted everything? {pause} Or the older son, who stayed but grew bitter? {pause} Or maybe you're the father, learning to love with abandon? {pause} Choose your place in the story and step into it. {silence 30 seconds} If you're the prodigal, imagine the moment you decide to come home. See yourself on the road, rehearsing your speech. {pause} Then you see him. Your father. And he's running. Running toward you with arms wide open. {pause} He doesn't wait for your apology. He wraps you in an embrace. He calls for a robe, a ring, a feast. {pause} Feel his love. Receive it. This is how God loves you. {pause} If you're the older brother, feel the resentment. The unfairness. {pause} And hear the father's words: 'Son, you are always with me, and all that I have is yours.' {pause} Let God speak to the parts of you that feel overlooked, that feel like faithfulness goes unrewarded. {pause} Wherever you are in this story, hear God speaking. {silence 90 seconds}",
      "defaultDuration": 720,
      "minDuration": 420,
      "maxDuration": 1200,
      "scriptureReferences": ["Luke 15:11-32"],
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "meditation-005",
      "sectionId": "section-meditation",
      "name": "Psalm 23 Contemplation",
      "description": "Slowly contemplate the beloved shepherd's Psalm",
      "scriptTemplate": "We'll meditate on Psalm 23 together. Listen slowly. {pause} 'The Lord is my shepherd; I shall not want.' {pause} The Lord is YOUR shepherd. You shall not want. What does that mean for you today? {silence 30 seconds} 'He makes me to lie down in green pastures; He leads me beside the still waters.' {pause} Where is He inviting you to rest? To find stillness? {silence 30 seconds} 'He restores my soul; He leads me in the paths of righteousness for His name's sake.' {pause} What in your soul needs restoring? {silence 30 seconds} 'Yea, though I walk through the valley of the shadow of death, I will fear no evil; For You are with me.' {pause} What valley are you walking through? And can you feel Him there with you? {silence 30 seconds} 'Your rod and Your staff, they comfort me.' {pause} Let His presence comfort you now. {silence 45 seconds} 'You prepare a table before me in the presence of my enemies; You anoint my head with oil; My cup runs over.' {pause} Receive His abundant blessing. {silence 30 seconds} 'Surely goodness and mercy shall follow me all the days of my life; And I will dwell in the house of the Lord forever.' {pause} Rest in this promise. {silence 90 seconds}",
      "defaultDuration": 780,
      "minDuration": 480,
      "maxDuration": 1200,
      "scriptureReferences": ["Psalm 23"],
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-29T00:00:00Z"
    },
    {
      "id": "meditation-006",
      "sectionId": "section-meditation",
      "name": "Abiding in the Vine",
      "description": "Jesus' teaching on remaining connected to Him for life and fruitfulness",
      "scriptTemplate": "Jesus teaches in John 15:5, 'I am the vine, you are the branches. He who abides in Me, and I in him, bears much fruit; for without Me you can do nothing.' {pause} I am the vine. You are the branches. {pause} Picture a grapevine. See Jesus as the main vine, strong and alive. See yourself as a branch, connected to Him. {pause} What does it mean to abide? To remain. To stay connected. To draw life from Him. {pause} Ask Jesus: 'Am I abiding in You? Or have I been trying to bear fruit on my own?' {pause} Listen. {silence 45 seconds} Without the vine, the branch withers. It can't produce anything. {pause} But connected to the vine, life flows. Sap rises. Fruit grows naturally. {pause} What fruit is God growing in your life? Love, joy, peace, patience? {pause} Or what areas feel dry, disconnected? {pause} Ask Him to show you how to abide more deeply. {silence 45 seconds} The invitation is simple: Stay connected. Remain in Him. Let His life flow through you. {pause} Rest in that connection now. {silence 90 seconds}",
      "defaultDuration": 660,
      "minDuration": 420,
      "maxDuration": 1200,
      "scriptureReferences": ["John 15:5", "Galatians 5:22-23"],
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-02-05T00:00:00Z"
    },
    {
      "id": "incorporate-001",
      "sectionId": "section-incorporate",
      "name": "Simple Reflection",
      "description": "Identify one thing to carry from the meditation into daily life",
      "scriptTemplate": "As we close, take a moment to reflect. {pause} What stood out to you in this meditation? Was there a word God spoke, a feeling you experienced, an insight that emerged? {pause} Ask yourself: What is one thing I want to take with me today? {silence 30 seconds} It might be a word like 'peace' or 'beloved.' It might be a promise from Scripture. It might be simply the reminder that God is with you. {pause} Hold it gently in your heart. {pause} As you return to your day, you can come back to this. Let it anchor you, remind you, draw you back to God's presence.",
      "defaultDuration": 120,
      "minDuration": 90,
      "maxDuration": 180,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-01T00:00:00Z"
    },
    {
      "id": "incorporate-002",
      "sectionId": "section-incorporate",
      "name": "Word to Remember",
      "description": "Choose a single word as a touchstone throughout the day",
      "scriptTemplate": "Before we close, let's distill this meditation into one word. {pause} If you had to choose one word that captures what God is speaking to you today, what would it be? {pause} Take a moment and let a word rise in your heart. {silence 30 seconds} Maybe it's 'rest.' Or 'trust.' Or 'beloved.' Or 'light.' {pause} Whatever your word is, write it on your heart. {pause} Throughout your day, when stress rises or you feel disconnected, come back to this word. {pause} Let it bring you back to this moment, to God's presence, to what He spoke to you here. {pause} This word is your anchor. Carry it with you.",
      "defaultDuration": 120,
      "minDuration": 90,
      "maxDuration": 180,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-08T00:00:00Z"
    },
    {
      "id": "incorporate-003",
      "sectionId": "section-incorporate",
      "name": "Action Step",
      "description": "Identify a specific way to live out what was learned",
      "scriptTemplate": "We've spent time with God, listening and receiving. Now we ask: How do I live this out? {pause} What is one specific action you can take today that reflects what God spoke to you in this meditation? {pause} Maybe it's reaching out to someone with love. Maybe it's releasing a worry you've been clutching. Maybe it's speaking truth where you've been silent. {pause} Ask God: 'What do You want me to do with what You've shown me?' {silence 30 seconds} Listen for His guidance. {pause} When an action comes to mind, commit to it. {pause} This is how meditation moves from the secret place into the world. We hear from God, then we act. {pause} Go now, and live what you've received.",
      "defaultDuration": 150,
      "minDuration": 120,
      "maxDuration": 180,
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-15T00:00:00Z"
    },
    {
      "id": "incorporate-004",
      "sectionId": "section-incorporate",
      "name": "Carrying God's Presence",
      "description": "Practice taking the secret place into all of life",
      "scriptTemplate": "Jesus promised in Matthew 28:20, 'I am with you always, even to the end of the age.' {pause} The secret place is not confined to this room or this moment. God is with you always. {pause} As you return to your day, practice carrying His presence with you. {pause} In the grocery store, He's there. In the difficult meeting, He's there. In the carpool line, He's there. In the moments of joy and the moments of pain, He's there. {pause} You can return to this awareness anytime. A quick breath, a whispered prayer, a moment of remembering. {pause} The door to the secret place is always open. You can step through it anywhere, anytime. {pause} Go now, carrying God's presence with you. You are never alone.",
      "defaultDuration": 150,
      "minDuration": 120,
      "maxDuration": 180,
      "scriptureReferences": ["Matthew 28:20"],
      "difficulty": "intermediate",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-22T00:00:00Z"
    },
    {
      "id": "incorporate-005",
      "sectionId": "section-incorporate",
      "name": "Gratitude Close",
      "description": "End with thanksgiving for God's presence and faithfulness",
      "scriptTemplate": "As we close this time together, let's give thanks. {pause} Thank God for meeting you here. For speaking to you. For His constant presence. {pause} Take a moment and offer your gratitude, either silently or out loud. {silence 30 seconds} Thank You, Father, for this time in the secret place. {pause} Thank You for seeing us, for knowing us, for loving us. {pause} Thank You that we can return here anytime, that the door is always open. {pause} Help us carry what we've received today into our lives. {pause} Help us remember that You are always with us. {pause} We give this day to You. {pause} In Jesus' name, Amen.",
      "defaultDuration": 120,
      "minDuration": 90,
      "maxDuration": 180,
      "difficulty": "beginner",
      "createdAt": "2025-01-01T00:00:00Z",
      "releasedAt": "2025-01-29T00:00:00Z"
    }
  ]
}
